<a href="https://colab.research.google.com/github/iqbalhanif/R-Intro/blob/main/Data_Manipulation_with_Tidyverse.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 1. Basic

In [ ]:
install.packages("gapminder")
library(gapminder)
library(tidyverse)
library(dplyr)
library(readr)
library(haven)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.3.2     ✔ purrr   0.3.4
✔ tibble  3.0.4     ✔ dplyr   1.0.2
✔ tidyr   1.1.2     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.0

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [ ]:
gapminder <- gapminder
head(gapminder)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [ ]:
summary(gapminder)

        country        continent        year         lifeExp
 Afghanistan:  12   Africa  :624   Min.   :1952   Min.   :23.60
 Albania    :  12   Americas:300   1st Qu.:1966   1st Qu.:48.20
 Algeria    :  12   Asia    :396   Median :1980   Median :60.71
 Angola     :  12   Europe  :360   Mean   :1980   Mean   :59.47
 Argentina  :  12   Oceania : 24   3rd Qu.:1993   3rd Qu.:70.85
 Australia  :  12                  Max.   :2007   Max.   :82.60
 (Other)    :1632
      pop              gdpPercap
 Min.   :6.001e+04   Min.   :   241.2
 1st Qu.:2.794e+06   1st Qu.:  1202.1
 Median :7.024e+06   Median :  3531.8
 Mean   :2.960e+07   Mean   :  7215.3
 3rd Qu.:1.959e+07   3rd Qu.:  9325.5
 Max.   :1.319e+09   Max.   :113523.1

In [ ]:
dim(gapminder)
names(gapminder)

[1] 1704    6

[1] "country"   "continent" "year"      "lifeExp"   "pop"       "gdpPercap"

## 2. Subsetting & Filtering

In [ ]:
## Download data
##install.packages('RCurl')
library(RCurl)
x <- getURL("http://sekhon.berkeley.edu/causalinf/midterm/FearonLaitin2003.asc")
y <- read.csv(text = x, sep = "")

In [ ]:
## Read data
wardata <- y
dim(wardata)
head(wardata)

[1] 6610   69

  ccode country cname cmark year wars war warl onset ethonset ⋯ empolity2l
1 2     USA     USA   1     1945 0    0   0    0     0        ⋯  7.68712
2 2     USA     USA   0     1946 0    0   0    0     0        ⋯ 10.00000
3 2     USA     USA   0     1947 0    0   0    0     0        ⋯ 10.00000
4 2     USA     USA   0     1948 0    0   0    0     0        ⋯ 10.00000
5 2     USA     USA   0     1949 0    0   0    0     0        ⋯ 10.00000
6 2     USA     USA   0     1950 0    0   0    0     0        ⋯ 10.00000
  sdwars sdonset colwars colonset cowwars cowonset cowwarl sdwarl colwarl
1 0      0       NA      NA       0       0        0       0      NA
2 0      0       NA      NA       0       0        0       0      NA
3 0      0       NA      NA       0       0        0       0      NA
4 0      0       NA      NA       0       0        0       0      NA
5 0      0       NA      NA       0       0        0       0      NA
6 0      0       NA      NA       0       0        0       0      NA

In [ ]:
##subset only first 10 rows, 20 columns
wardata[1:10, 1:20]

   ccode country cname cmark year wars war warl onset ethonset durest aim
1  2     USA     USA   1     1945 0    0   0    0     0        NA     NA
2  2     USA     USA   0     1946 0    0   0    0     0        NA     NA
3  2     USA     USA   0     1947 0    0   0    0     0        NA     NA
4  2     USA     USA   0     1948 0    0   0    0     0        NA     NA
5  2     USA     USA   0     1949 0    0   0    0     0        NA     NA
6  2     USA     USA   0     1950 0    0   0    0     0        NA     NA
7  2     USA     USA   0     1951 0    0   0    0     0        NA     NA
8  2     USA     USA   0     1952 0    0   0    0     0        NA     NA
9  2     USA     USA   0     1953 0    0   0    0     0        NA     NA
10 2     USA     USA   0     1954 0    0   0    0     0        NA     NA
   casename ended ethwar waryrs pop    lpop     polity2 gdpen
1           NA    NA            140969 11.85630 10      7.626000
2           NA    NA            141936 11.86313 10      7.654000
3           NA    NA            142713 11.86859 10      8.025000
4           NA    NA            145326 11.88673 10      8.270001
5           NA    NA            147987 11.90488 10      8.040000
6           NA    NA            152273 11.93343 10      8.772000
7           NA    NA            155000 11.95118 10      9.109000
8           NA    NA            157727 11.96862 10      9.074000
9           NA    NA            160475 11.98589 10      9.300000
10          NA    NA            163202 12.00274 10      9.089000

In [ ]:
##subset first 10 rows, column country and year
wardata[1:10, c("country", "year")]

   country year
1  USA     1945
2  USA     1946
3  USA     1947
4  USA     1948
5  USA     1949
6  USA     1950
7  USA     1951
8  USA     1952
9  USA     1953
10 USA     1954

In [ ]:
## subset country == "USA", year 1945 and 1950
subset(wardata, country =="USA" & year == c(1945, 1950))

  ccode country cname cmark year wars war warl onset ethonset ⋯ empolity2l
1 2     USA     USA   1     1945 0    0   0    0     0        ⋯  7.68712
6 2     USA     USA   0     1950 0    0   0    0     0        ⋯ 10.00000
  sdwars sdonset colwars colonset cowwars cowonset cowwarl sdwarl colwarl
1 0      0       NA      NA       0       0        0       0      NA
6 0      0       NA      NA       0       0        0       0      NA

In [ ]:
## filter country USA year 1945 and 1950
wardata %>%
  filter(country == "USA", year == c(1945, 1950))

  ccode country cname cmark year wars war warl onset ethonset ⋯ empolity2l
1 2     USA     USA   1     1945 0    0   0    0     0        ⋯  7.68712
2 2     USA     USA   0     1950 0    0   0    0     0        ⋯ 10.00000
  sdwars sdonset colwars colonset cowwars cowonset cowwarl sdwarl colwarl
1 0      0       NA      NA       0       0        0       0      NA
2 0      0       NA      NA       0       0        0       0      NA

In [ ]:
##gapminder filter United States & 2007
gapminder %>%
  filter(country == "United States", year == 2007)

  country       continent year lifeExp pop       gdpPercap
1 United States Americas  2007 78.242  301139947 42951.65

In [ ]:
#gapminder: filter() year 2007 arrange dpPercap desc order
gapminder %>%
  filter(year == 2007) %>%
  arrange(desc(gdpPercap))

    country                  continent year lifeExp pop       gdpPercap
1   Norway                   Europe    2007 80.196    4627926 49357.19
2   Kuwait                   Asia      2007 77.588    2505559 47306.99
3   Singapore                Asia      2007 79.972    4553009 47143.18
4   United States            Americas  2007 78.242  301139947 42951.65
5   Ireland                  Europe    2007 78.885    4109086 40676.00
6   Hong Kong, China         Asia      2007 82.208    6980412 39724.98
7   Switzerland              Europe    2007 81.701    7554661 37506.42
8   Netherlands              Europe    2007 79.762   16570613 36797.93
9   Canada                   Americas  2007 80.653   33390141 36319.24
10  Iceland                  Europe    2007 81.757     301931 36180.79
11  Austria                  Europe    2007 79.829    8199783 36126.49
12  Denmark                  Europe    2007 78.332    5468120 35278.42
13  Australia                Oceania   2007 81.235   20434176 34435.37
14  Sweden                   Europe    2007 80.884    9031088 33859.75
15  Belgium                  Europe    2007 79.441   10392226 33692.61
16  Finland                  Europe    2007 79.313    5238460 33207.08
17  United Kingdom           Europe    2007 79.425   60776238 33203.26
18  Germany                  Europe    2007 79.406   82400996 32170.37
19  Japan                    Asia      2007 82.603  127467972 31656.07
20  France                   Europe    2007 80.657   61083916 30470.02
21  Bahrain                  Asia      2007 75.635     708573 29796.05
22  Spain                    Europe    2007 80.941   40448191 28821.06
23  Taiwan                   Asia      2007 78.400   23174294 28718.28
24  Italy                    Europe    2007 80.546   58147733 28569.72
25  Greece                   Europe    2007 79.483   10706290 27538.41
26  Slovenia                 Europe    2007 77.926    2009245 25768.26
27  Israel                   Asia      2007 80.745    6426679 25523.28
28  New Zealand              Oceania   2007 80.204    4115771 25185.01
29  Korea, Rep.              Asia      2007 78.623   49044790 23348.14
30  Czech Republic           Europe    2007 76.486   10228744 22833.31
⋮   ⋮                        ⋮         ⋮    ⋮       ⋮         ⋮
113 Bangladesh               Asia      2007 64.062  150448339 1391.2538
114 Ghana                    Africa    2007 60.022   22873338 1327.6089
115 Zambia                   Africa    2007 42.384   11746035 1271.2116
116 Burkina Faso             Africa    2007 52.295   14326203 1217.0330
117 Haiti                    Americas  2007 60.916    8502814 1201.6372
118 Tanzania                 Africa    2007 52.517   38139640 1107.4822
119 Nepal                    Asia      2007 63.785   28901790 1091.3598
120 Uganda                   Africa    2007 51.542   29170398 1056.3801
121 Madagascar               Africa    2007 59.443   19167654 1044.7701
122 Mali                     Africa    2007 54.467   12031795 1042.5816
123 Comoros                  Africa    2007 65.152     710960  986.1479
124 Afghanistan              Asia      2007 43.828   31889923  974.5803
125 Myanmar                  Asia      2007 62.069   47761980  944.0000
126 Guinea                   Africa    2007 56.007    9947814  942.6542
127 Somalia                  Africa    2007 48.159    9118773  926.1411
128 Togo                     Africa    2007 58.420    5701579  882.9699
129 Rwanda                   Africa    2007 46.242    8860588  863.0885
130 Sierra Leone             Africa    2007 42.568    6144562  862.5408
131 Mozambique               Africa    2007 42.082   19951656  823.6856
132 Malawi                   Africa    2007 48.303   13327079  759.3499
133 Gambia                   Africa    2007 59.448    1688359  752.7497
134 Central African Republic Africa    2007 44.741    4369038  706.0165
135 Ethiopia                 Africa    2007 52.947   76511887  690.8056
136 Eritrea                  Africa    2007 58.040    4906585  641.3695
137 Niger                    Africa    2007 56.867   12894865  619.6769
138 Guinea-Bissau            Africa    2007 46.388    1472041  579.2317
139 Zimbabwe                 Africa    2007 43.487   12311143  469.7093
140 Burundi                  Africa    2007 49.580    8390505  430.0707
141 Liberia                  Africa    2007 45.678    3193942  414.5073
142 Congo, Dem. Rep.         Africa    2007 46.462   64606759  277.5519

##3. Mutate (Replacing Value & Adding New Variable)

In [ ]:
#check
gapminder %>%
  arrange(desc(pop))

     country               continent year lifeExp  pop        gdpPercap
1    China                 Asia      2007 72.96100 1318683096  4959.1149
2    China                 Asia      2002 72.02800 1280400000  3119.2809
3    China                 Asia      1997 70.42600 1230075000  2289.2341
4    China                 Asia      1992 68.69000 1164970000  1655.7842
5    India                 Asia      2007 64.69800 1110396331  2452.2104
6    China                 Asia      1987 67.27400 1084035000  1378.9040
7    India                 Asia      2002 62.87900 1034172547  1746.7695
8    China                 Asia      1982 65.52500 1000281000   962.4214
9    India                 Asia      1997 61.76500  959000000  1458.8174
10   China                 Asia      1977 63.96736  943455000   741.2375
11   India                 Asia      1992 60.22300  872000000  1164.4068
12   China                 Asia      1972 63.11888  862030000   676.9001
13   India                 Asia      1987 58.55300  788000000   976.5127
14   China                 Asia      1967 58.38112  754550000   612.7057
15   India                 Asia      1982 56.59600  708000000   855.7235
16   China                 Asia      1962 44.50136  665770000   487.6740
17   China                 Asia      1957 50.54896  637408000   575.9870
18   India                 Asia      1977 54.20800  634000000   813.3373
19   India                 Asia      1972 50.65100  567000000   724.0325
20   China                 Asia      1952 44.00000  556263527   400.4486
21   India                 Asia      1967 47.19300  506000000   700.7706
22   India                 Asia      1962 43.60500  454000000   658.3472
23   India                 Asia      1957 40.24900  409000000   590.0620
24   India                 Asia      1952 37.37300  372000000   546.5657
25   United States         Americas  2007 78.24200  301139947 42951.6531
26   United States         Americas  2002 77.31000  287675526 39097.0995
27   United States         Americas  1997 76.81000  272911760 35767.4330
28   United States         Americas  1992 76.09000  256894189 32003.9322
29   United States         Americas  1987 75.02000  242803533 29884.3504
30   United States         Americas  1982 74.65000  232187835 25009.5591
⋮    ⋮                     ⋮         ⋮    ⋮        ⋮          ⋮
1675 Bahrain               Asia      1967 59.923   202182      14804.6727
1676 Sao Tome and Principe Africa    2007 65.528   199579       1598.4351
1677 Iceland               Europe    1967 73.730   198676      13319.8957
1678 Equatorial Guinea     Africa    1977 42.024   192675        958.5668
1679 Comoros               Africa    1962 44.467   191689       1406.6483
1680 Iceland               Europe    1962 73.680   182053      10350.1591
1681 Djibouti              Africa    1972 44.366   178848       3694.2124
1682 Bahrain               Asia      1962 56.923   171863      12753.2751
1683 Comoros               Africa    1957 42.460   170928       1211.1485
1684 Sao Tome and Principe Africa    2002 64.337   170372       1353.0924
1685 Iceland               Europe    1957 73.470   165110       9244.0014
1686 Kuwait                Asia      1952 55.565   160000     108382.3529
1687 Comoros               Africa    1952 40.715   153936       1102.9909
1688 Iceland               Europe    1952 72.490   147962       7267.6884
1689 Sao Tome and Principe Africa    1997 63.306   145608       1339.0760
1690 Bahrain               Asia      1957 53.832   138655      11635.7995
1691 Djibouti              Africa    1967 42.074   127617       3020.0505
1692 Sao Tome and Principe Africa    1992 62.742   125911       1428.7778
1693 Bahrain               Asia      1952 50.939   120447       9867.0848
1694 Sao Tome and Principe Africa    1987 61.728   110812       1516.5255
1695 Sao Tome and Principe Africa    1982 60.351    98593       1890.2181
1696 Djibouti              Africa    1962 39.693    89898       3020.9893
1697 Sao Tome and Principe Africa    1977 58.550    86796       1737.5617
1698 Sao Tome and Principe Africa    1972 56.480    76595       1532.9853
1699 Djibouti              Africa    1957 37.328    71851       2864.9691
1700 Sao Tome and Principe Africa    1967 54.425    70787       1384.8406
1701 Sao Tome and Principe Africa    1962 51.893    65345       1071.5511
1702 Djibouti              Africa    1952 34.812    63149       2669.5295
1703 Sao Tome and Principe Africa    1957 48.945    61325        860.7369
1704 Sao Tome and Principe Africa    1952 46.471    60011        879.5836

In [ ]:
##gapminder: shirten values in pop variable (divide by 1 mio)
pop_million <- gapminder %>%
                mutate(pop = pop/1000000) %>%
                arrange(desc(pop))
head(pop_million)

  country continent year lifeExp pop      gdpPercap
1 China   Asia      2007 72.961  1318.683 4959.115
2 China   Asia      2002 72.028  1280.400 3119.281
3 China   Asia      1997 70.426  1230.075 2289.234
4 China   Asia      1992 68.690  1164.970 1655.784
5 India   Asia      2007 64.698  1110.396 2452.210
6 China   Asia      1987 67.274  1084.035 1378.904

In [ ]:
##creating new var gdo from gdpPercap * pop
gapminder_gdp <- gapminder %>%
                  mutate(gdp = gdpPercap * pop) %>%
                  arrange(desc(gdp))
head(gapminder_gdp)

  country       continent year lifeExp pop        gdpPercap gdp
1 United States Americas  2007 78.242   301139947 42951.653 1.293446e+13
2 United States Americas  2002 77.310   287675526 39097.100 1.124728e+13
3 United States Americas  1997 76.810   272911760 35767.433 9.761353e+12
4 United States Americas  1992 76.090   256894189 32003.932 8.221624e+12
5 United States Americas  1987 75.020   242803533 29884.350 7.256026e+12
6 China         Asia      2007 72.961  1318683096  4959.115 6.539501e+12

In [ ]:
#shorten gpd values into mio US
gapminder_gdp_mill <- gapminder_gdp%>%
                      mutate(gdp = gdp / 1000000) %>%
                      arrange(desc(gdp))
head(gapminder_gdp_mill)

  country       continent year lifeExp pop        gdpPercap gdp
1 United States Americas  2007 78.242   301139947 42951.653 12934459
2 United States Americas  2002 77.310   287675526 39097.100 11247279
3 United States Americas  1997 76.810   272911760 35767.433  9761353
4 United States Americas  1992 76.090   256894189 32003.932  8221624
5 United States Americas  1987 75.020   242803533 29884.350  7256026
6 China         Asia      2007 72.961  1318683096  4959.115  6539501

## 4. Data Cleaning

In [ ]:
#cekdata
tail(wardata)

     ccode country cname cmark year wars war warl onset ethonset ⋯ sdwars
6605 950   FIJI    FIJI  0     1994 0    0   0    0     0        ⋯ 0
6606 950   FIJI    FIJI  0     1995 0    0   0    0     0        ⋯ 0
6607 950   FIJI    FIJI  0     1996 0    0   0    0     0        ⋯ 0
6608 950   FIJI    FIJI  0     1997 0    0   0    0     0        ⋯ 0
6609 950   FIJI    FIJI  0     1998 0    0   0    0     0        ⋯ 0
6610 950   FIJI    FIJI  0     1999 0    0   0    0     0        ⋯ 0
     sdonset colwars colonset cowwars cowonset cowwarl sdwarl colwarl codeyear
6605 0       0       0        NA      NA       NA      0      0       9501994
6606 0       0       0        NA      NA       NA      0      0       9501995
6607 0       0       0        NA      NA       NA      0      0       9501996
6608 0       0       0        NA      NA       NA      0      0       9501997
6609 0       0       0        NA      NA       NA      0      0       9501998
6610 0       0       0        NA      NA       NA      0      0       9501999

In [ ]:
#create a unique identifier
wardata$codeyear <- wardata$ccode*10000 + wardata$year
wardata$codeyear[1:10]

 [1] 21945 21946 21947 21948 21949 21950 21951 21952 21953 21954

In [ ]:
#check var name in wardata
names(wardata)

 [1] "ccode"      "country"    "cname"      "cmark"      "year"
 [6] "wars"       "war"        "warl"       "onset"      "ethonset"
[11] "durest"     "aim"        "casename"   "ended"      "ethwar"
[16] "waryrs"     "pop"        "lpop"       "polity2"    "gdpen"
[21] "gdptype"    "gdpenl"     "lgdpenl1"   "lpopl1"     "region"
[26] "western"    "eeurop"     "lamerica"   "ssafrica"   "asia"
[31] "nafrme"     "colbrit"    "colfra"     "mtnest"     "lmtnest"
[36] "elevdiff"   "Oil"        "ncontig"    "ethfrac"    "ef"
[41] "plural"     "second"     "numlang"    "relfrac"    "plurrel"
[46] "minrelpc"   "muslim"     "nwstate"    "polity2l"   "instab"
[51] "anocl"      "deml"       "empethfrac" "empwarl"    "emponset"
[56] "empgdpenl"  "emplpopl"   "emplmtnest" "empncontig" "empolity2l"
[61] "sdwars"     "sdonset"    "colwars"    "colonset"   "cowwars"
[66] "cowonset"   "cowwarl"    "sdwarl"     "colwarl"    "codeyear"

In [ ]:
#prove is there any duplicate info
length(wardata$codeyear)
length(unique(wardata$codeyear))

[1] 6610

[1] 6610

In [ ]:
##load data with duplictae
spesies_data <- as_tibble(iris)
dim(spesies_data)

[1] 150   5

In [ ]:
#check duplicate values in rows of a variable (Sepal Length)
duplicates_Sepal <- spesies_data[duplicated(spesies_data$Sepal.Length),]
head(duplicates_Sepal)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 4.6          3.4         1.4          0.3         setosa
2 5.0          3.4         1.5          0.2         setosa
3 4.9          3.1         1.5          0.1         setosa
4 5.4          3.7         1.5          0.2         setosa
5 4.8          3.0         1.4          0.1         setosa
6 5.4          3.9         1.3          0.4         setosa

In [ ]:
#keep only non-duplicate rows (duplicated) based on a specific variable
unique_Sepal <- spesies_data[!duplicated(spesies_data$Sepal.Length),]
head(unique_Sepal)
dim(unique_Sepal)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa
3 4.7          3.2         1.3          0.2         setosa
4 4.6          3.1         1.5          0.2         setosa
5 5.0          3.6         1.4          0.2         setosa
6 5.4          3.9         1.7          0.4         setosa

[1] 35  5

In [ ]:
#remove duplicated rows using unique()
unique_rows <- unique(spesies_data)
dim(unique_rows)

[1] 149   5

In [ ]:
#remove duplicated rows using dsitinct()
distinct_rows <- spesies_data %>%
                  distinct()
dim(distinct_rows)

[1] 149   5

In [ ]:
#reomve duplicates based on multiple column
distinct_sepal_petal <- spesies_data %>%
                          distinct(Sepal.Length, Petal.Width, .keep_all = TRUE)
dim(distinct_sepal_petal)

[1] 110   5

## 5. Replacing or Removing Missing Values

In [ ]:
# import titanic.csv dataset
install.packages("titanic")
library(titanic)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [ ]:
#check df
df_titanic <- titanic_train
head(df_titanic)

  PassengerId Survived Pclass
1 1           0        3
2 2           1        1
3 3           1        3
4 4           1        1
5 5           0        3
6 6           0        3
  Name                                                Sex    Age SibSp Parch
1 Braund, Mr. Owen Harris                             male   22  1     0
2 Cumings, Mrs. John Bradley (Florence Briggs Thayer) female 38  1     0
3 Heikkinen, Miss. Laina                              female 26  0     0
4 Futrelle, Mrs. Jacques Heath (Lily May Peel)        female 35  1     0
5 Allen, Mr. William Henry                            male   35  0     0
6 Moran, Mr. James                                    male   NA  0     0
  Ticket           Fare    Cabin Embarked
1 A/5 21171         7.2500       S
2 PC 17599         71.2833 C85   C
3 STON/O2. 3101282  7.9250       S
4 113803           53.1000 C123  S
5 373450            8.0500       S
6 330877            8.4583       Q

In [ ]:
#check df
dim(df_titanic)
names(df_titanic)

[1] 891  12

 [1] "PassengerId" "Survived"    "Pclass"      "Name"        "Sex"
 [6] "Age"         "SibSp"       "Parch"       "Ticket"      "Fare"
[11] "Cabin"       "Embarked"

In [ ]:
#check where missing vaue is located
list_na <- colnames(df_titanic) [apply(df_titanic, 2, anyNA)]
list_na

[1] "Age"

In [ ]:
#check missing value in Age column, showed by Name and Sex
df_titanic[is.na(df_titanic$Age), c("Name", "Sex")]

    Name                                           Sex
6   Moran, Mr. James                               male
18  Williams, Mr. Charles Eugene                   male
20  Masselmani, Mrs. Fatima                        female
27  Emir, Mr. Farred Chehab                        male
29  O'Dwyer, Miss. Ellen "Nellie"                  female
30  Todoroff, Mr. Lalio                            male
32  Spencer, Mrs. William Augustus (Marie Eugenie) female
33  Glynn, Miss. Mary Agatha                       female
37  Mamee, Mr. Hanna                               male
43  Kraeff, Mr. Theodor                            male
46  Rogers, Mr. William John                       male
47  Lennon, Mr. Denis                              male
48  O'Driscoll, Miss. Bridget                      female
49  Samaan, Mr. Youssef                            male
56  Woolner, Mr. Hugh                              male
65  Stewart, Mr. Albert A                          male
66  Moubarek, Master. Gerios                       male
77  Staneff, Mr. Ivan                              male
78  Moutal, Mr. Rahamin Haim                       male
83  McDermott, Miss. Brigdet Delia                 female
88  Slocovski, Mr. Selman Francis                  male
96  Shorney, Mr. Charles Joseph                    male
102 Petroff, Mr. Pastcho ("Pentcho")               male
108 Moss, Mr. Albert Johan                         male
110 Moran, Miss. Bertha                            female
122 Moore, Mr. Leonard Charles                     male
127 McMahon, Mr. Martin                            male
129 Peter, Miss. Anna                              female
141 Boulos, Mrs. Joseph (Sultana)                  female
155 Olsen, Mr. Ole Martin                          male
⋮   ⋮                                              ⋮
719 McEvoy, Mr. Michael                            male
728 Mannion, Miss. Margareth                       female
733 Knight, Mr. Robert J                           male
739 Ivanoff, Mr. Kanio                             male
740 Nankoff, Mr. Minko                             male
741 Hawksford, Mr. Walter James                    male
761 Garfirth, Mr. John                             male
767 Brewe, Dr. Arthur Jackson                      male
769 Moran, Mr. Daniel J                            male
774 Elias, Mr. Dibo                                male
777 Tobin, Mr. Roger                               male
779 Kilgannon, Mr. Thomas J                        male
784 Johnston, Mr. Andrew G                         male
791 Keane, Mr. Andrew "Andy"                       male
793 Sage, Miss. Stella Anna                        female
794 Hoyt, Mr. William Fisher                       male
816 Fry, Mr. Richard                               male
826 Flynn, Mr. John                                male
827 Lam, Mr. Len                                   male
829 McCormack, Mr. Thomas Joseph                   male
833 Saad, Mr. Amin                                 male
838 Sirota, Mr. Maurice                            male
840 Marechal, Mr. Pierre                           male
847 Sage, Mr. Douglas Bullen                       male
850 Goldenberg, Mrs. Samuel L (Edwiga Grabowska)   female
860 Razi, Mr. Raihed                               male
864 Sage, Miss. Dorothy Edith "Dolly"              female
869 van Melkebeke, Mr. Philemon                    male
879 Laleff, Mr. Kristo                             male
889 Johnston, Miss. Catherine Helen "Carrie"       female

In [ ]:
#removing rows with missing values
df_titanic_omit <- df_titanic %>%
                    na.omit()
dim(df_titanic)
dim(df_titanic_omit)

[1] 891  12

[1] 714  12

In [ ]:
#Replace NA with Average of Passanger Age
df_titanic$Age[which(is.na(df_titanic$Age))] <- mean(df_titanic$Age, na.rm = TRUE)

In [ ]:
#check where is missing value
print(df_titanic[is.na(df_titanic$Age)])

data frame with 0 columns and 891 rows

# 6. Merging Datasets

In [ ]:
## import expop.txt
library(RCurl)
x <- getURL("https://raw.githubusercontent.com/datasets/population/master/data/population.csv")
y <- read.csv(text = x)

In [ ]:
exppop <- y
head(exppop)

  Country.Name Country.Code Year Value
1 Arab World   ARB          1960  92197753
2 Arab World   ARB          1961  94724510
3 Arab World   ARB          1962  97334442
4 Arab World   ARB          1963 100034179
5 Arab World   ARB          1964 102832760
6 Arab World   ARB          1965 105736431

In [ ]:
#encode CountryCode into number
encode_ordinal <- function(x, order = unique(x)) {
  x <- as.numeric(factor(x, levels = order, exclude = NULL))
  x
}

exppop[["Country.Encoded"]] <- encode_ordinal(exppop[["Country.Code"]])
tail(exppop)

      Country.Name Country.Code Year Value    Country.Encoded
15404 Zimbabwe     ZWE          2013 13350356 263
15405 Zimbabwe     ZWE          2014 13586681 263
15406 Zimbabwe     ZWE          2015 13814629 263
15407 Zimbabwe     ZWE          2016 14030390 263
15408 Zimbabwe     ZWE          2017 14236745 263
15409 Zimbabwe     ZWE          2018 14439018 263

In [ ]:
## check varnames
names(exppop)

[1] "Country.Name"    "Country.Code"    "Year"            "Value"
[5] "Country.Encoded"

In [ ]:
## create similar unique identifier
exppop$idyear <- exppop$Country.Encoded * 10000 + exppop$Year
head(exppop)

  Country.Name Country.Code Year Value     Country.Encoded idyear
1 Arab World   ARB          1960  92197753 1               11960
2 Arab World   ARB          1961  94724510 1               11961
3 Arab World   ARB          1962  97334442 1               11962
4 Arab World   ARB          1963 100034179 1               11963
5 Arab World   ARB          1964 102832760 1               11964
6 Arab World   ARB          1965 105736431 1               11965

In [ ]:
## check duplicates idyear
length(exppop$idyear)
length(unique(exppop$idyear))

[1] 15409

[1] 15409

In [ ]:
##has similiar variabel with wardata ---> pop var must be changed inot pop_ex
##gagal